# _*_ coding: utf-8 _*_
# @Time: 2024/5/15 9:51
# @Author: LBJ辉
# @File: code1-2-注释
# @Project: nxops-01


# 块注释
# 以 # 开始，一直到本行结束都是注释
# 为了保证代码的可读性，# 后面建议先添加一个空格，然后再编写相应的说明文字
# 注释不会运行
# 代码是给机器执行用的，注释是给人看的，方便阅读代码时，能够快速的了解代码的功能

# 行内注释
# 以 # 开始，一直到本行结束都是注释
# 与代码写在同一行
# # 前面至少有两个空格

"""
多行注释
如果希望编写的注释信息很多，一行无法显示，就可以使用多行注释
要在 python 程序中使用多行注释，可以用 一对 连续的 三个引号（单引号和双引号都可以）
"""

"""
使用规范：
1. 注释不是越多越好，对于一目了然的代码，不需要添加注释
2. 对于复杂的操作，应该在操作开始前写上若干行注释
3， 对于不是一目了然的代码，应在其行尾添加注释
4. 绝不要描述代码，假设阅读代码的人比你更懂 Python，他只是不知道你的代码要做什么
"""